<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of ChatGPT and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.pappirauk.munki.ChatGPT</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ChatGPT</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/ChatGPT</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
				<string>production</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Enterprise-grade security and privacy and the most powerful version of ChatGPT yet.</string>
			<key>developer</key>
			<string>Open AI GmbH</string>
			<key>display_name</key>
			<string>ChatGPT</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.ChatGPT</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>%pathname%/ChatGPT.app/Contents/Info.plist</string>
			<key>plist_version_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
		<key>Processor</key>
		<string>Versioner</string>
		</dict>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%pathname%</string>
			<key>repo_subdirectory</key>
			<string>%MUNKI_REPO_SUBDIR%</string>
		</dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>